       01  TAX-CODE-TABLE.
           05 TAX-CODE-ENTRY OCCURS 4 TIMES.
              10 TAX-CODE-KEY        PIC X.
              10 TAX-RATE            PIC 9V9999.
