       >>SOURCE FORMAT FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TAXRATE.

       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-TAX-CODE                PIC X.
       01 LK-TAX-PERCENT             PIC 9V9999.

       PROCEDURE DIVISION USING LK-TAX-CODE LK-TAX-PERCENT.
           EVALUATE LK-TAX-CODE
              WHEN "S" MOVE 0.0725 TO LK-TAX-PERCENT
              WHEN "R" MOVE 0.0250 TO LK-TAX-PERCENT
              WHEN "L" MOVE 0.1000 TO LK-TAX-PERCENT
              WHEN OTHER MOVE 0.0000 TO LK-TAX-PERCENT
           END-EVALUATE
           GOBACK.
